Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: བཟོད་པ་བསྟེན་པར་བྱ་བས་ཐམས་ཅད་བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པར་མི་འགྱུར་ཞིང་ཐམས་ཅད་དེ་ལས་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་འགྱུར་རོ། །
en: After they die, they will all be reborn in this buddha realm.

source: ཆུང་ངུ་ན་སེམས་ཅན་གཅིག་ཀྱང་དེ་ན་ངན་སོང་གསུམ་ལས་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་འགྱུར་རོ། །
en: Even the smallest one of those beings living in the lower realms will be reborn in this buddha realm after they die.

source: ཆུང་ངུ་ན་སེམས་ཅན་གཅིག་ཀྱང་གང་ཡོན་ཏན་འདི་དག་གིས་ཡང་དག་པར་བརྒྱན་པར་བྱས་པ་མེད་པར་སངས་རྒྱས་ཀྱི་ཞིང་དེར་གཏོང་བར་མི་བྱ་སྟེ། །
en: Even the smallest one of those beings will not be cast into a buddha realm that is not perfectly adorned with these qualities.

source: ཞག་བདུན་པ་བདུན་པ་དེ་ལས་འདས་པས་མྱ་ངན་ལས་འདས་པའི་ཁམས་སུ་ཕུང་པོའི་ལྷག་མ་མ་ལུས་པར་མྱ་ངན་ལས་འདའ་བར་བྱ་བར་ཚངས་པའི་དབང་པོ་དེའི་སྤྱན་སྔར་བདག་གིས་སྨོན་ལམ་དེ་བཞིན་དུ་བཏབ་པར་གྱུར་ཏོ། །
en: After those seven weeks have passed, I will reach the realm of nirvāṇa and pass into nirvāṇa without remainder of aggregates.’ Those were the aspirations I made in the presence of the Lord of the Brahmā Realm.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་ནི་རྣམ་པ་དེ་ལྟ་བུའི་སྨོན་ལམ་གྲུབ་པས་མ་འོངས་པའི་དུས་ན་རྣམ་པ་དེ་ལྟ་བུའི་རྩལ་ཆེན་པོ་བྱ་བར་ཡང་ནུས་པར་འགྱུར་རོ། །
en: “I then said, ‘Respected Blessed One, in the future when I have fulfilled those aspirations, it will enable me to generate various great skills.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་སྔོན་ལྟ་བ་ཅན་དེ་དག་གི་རྒྱུན་བཅད་དེ། །
en: Respected Blessed One, I eliminated those wrong views long ago.

source: དེ་ལྟར་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་ཇི་ལྟར་མངོན་དུ་གྱུར་པར་འགྱུར་བ་ལ། དེ་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བགྱིའོ། །
en: Please issue your prophesy about my unsurpassed and perfect awakening so that it will be evident to this entire assembly!’

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་དེས་ཡང་བདག་ལ་བཀའ་སྩལ་པ། ཤིན་ཏུ་ཟབ་མོ།
en: “The Thus-Gone One Lord of the Brahmā Realm replied, ‘This is extremely profound!

source: ཤིན་ཏུ་ངོ་མཚར་བ།
en: This is amazing!

source: ཤིན་ཏུ་རྒྱ་ཆེ་བའི་སྨོན་ལམ་བཏབ་པ་ནི་ནམ་མཁའ་ལ་འབྲུག་ཟེར་བས་ཆུས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱེད། ཆུའི་རྫིང་དང་། ལྟེང་ཀའི་སྒོར་ཡོངས་སུ་རྫོགས་པར་བྱེད། ཤིན་ཏུ་དྲོ་བས་གདུངས་པའི་སེམས་ཅན་རྣམས་དང་།
en: Those vast aspirations you have made are like a thunderclap in the sky that brings rain to satiate beings, fills lakes and ponds, and satiates the beings, medicinal plants, leaves, forests, and thickets that are tormented by scorching heat.

source: སྨན་དང་། ལོ་མ་དང་། ནགས་ཚལ་དང་། ཤིང་གེལ་པ་རྣམས་ཚིམ་པར་བྱེད་དོ། །རིགས་ཀྱི་བུ་ནམ་མཁའ་ལ་འབྲུག་བསྒྲགས་པ་དེ་བཞིན་དུ་ཤིན་ཏུ་ཟབ་མོའི་སྨོན་ལམ་འདིས་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་འདི་དག་ལ་གཞོག་པར་བྱེད་དོ། །
en: Noble son, those extremely profound aspirations that are like a thunderclap resounding in the sky nourish this entire assembly.

source: རིགས་ཀྱི་བུ་མི་བཟད་པར་བརྩོན་པའི་སྨོན་ལམ་གྱིས་རྣམ་པ་དེ་ལྟ་བུའི་སྨོན་ལམ་འགྲུབ་པར་འགྱུར་རོ། །
en: Noble son, those who make aspirations with intense enthusiasm will fulfill all of their aspirations.

source: མ་འོངས་པའི་དུས་ན་ཁྱོད་སངས་རྒྱས་ཀྱི་ཞིང་ཀུན་ནས་གཟི་བརྗིད་དུ་བསྐལ་པའི་འོད་ཆེན་པོར་འགྱུར་རོ། །
en: In the future, you will appear in the buddha realm Utterly Magnificent during the eon Great Light.

source: དེ་ན་ཡང་རིགས་ཀྱི་བུ་ཁྱོད་འཇིག་རྟེན་དུ་སངས་རྒྱས་སུ་སྐྱེ་ཞིང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་ཞིང་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དབྱངས་མ་ལུས་པའི་གནས་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: Noble son, you will take birth as the buddha in that world, and you will be the wise and venerable thus-gone one, the worthy, perfect buddha, the unsurpassed guide who tames beings, and teacher of both gods and humans known as the blessed thus-gone one Sovereign King of all Melodies.’

source: དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་དེ་ལ་ཡན་ལག་ལྔས་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་མ་ཐག་ཏུ་བདག་གི་སྤྱི་བོ་ས་ལ་རེག་པ་ཙམ་གྱིས་ན། དེ་ན་དེ་ཉིད་ཀྱི་ཚེ་ན་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅུའི་ས་ཆུ་ཟླ་བཞིན་དུ་རབ་ཏུ་གཡོས་སོ། །ལྷ་དང་། དྲི་ཟ་དང་།
en: “As soon as I did a full-length prostration at the feet of the thus-gone one Lord of the Brahmā Realm, right when I touched the ground with the top of my head, the ground of ten thousand buddha realms started to tremble like the reflection of the moon in water.”

source: ལྷ་མ་ཡིན་དང་། མིའི་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་འདིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །སྐྱེས་བུ་དམ་པ་ཆོས་ཆེན་པོ། སྙིང་རྗེ་ཆེན་པོ་ཅན། བརྩོན་འགྲུས་བརྟན་པ་དང་། བརྩོན་པ་དང་མཐུ་ཆེན་པོ་ཤིན་ཏུ་དཀའ་བའི་སྨོན་ལམ་བཏབ་པ་ལེགས་སོ་ལེགས་སོ། །
en: Then, all the assemblies of gods, gandharvas, asuras, and humans applauded, saying, “Holy being endowed with the excellent Dharma and great compassion, those extremely difficult aspirations you made with firm diligence, strong enthusiasm, and great power are excellent, excellent!”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཁྱོད་དེ་ན་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་ཉན་ཐོས་ཀྱི་འཁོར་དང་བཅས་པ་ལ་ཟླ་བ་གསུམ་དུ་བསྙེན་བཀུར་བྱས་པ་དེ་ལྟར་བདག་ཉི་མ་རེ་རེ་ཞིང་ཡང་བཅོམ་ལྡན་འདས་དེ་ལ་མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། སྤོས་སྣ་ཚོགས་ཀྱིས་མཆོད་པས་མཆོད་པའི་གནས་སུ་བྱས་པར་གྱུར་ཏོ། །
en: “Respected Blessed One, just as you served the thus-gone one Lord of the Brahmā Realm and his saṅgha of hearers in that place for three months by offering them all kinds of provisions, I also treated that Blessed One as an object of worship every day by offering him various types of flowers, perfumes, garlands, and incense.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཁྱོད་ཟླ་བ་གསུམ་པ་དེ་དག་ལས་ཤིན་ཏུ་འདས་ནས་རྒྱལ་པོའི་ལོངས་སྤྱོད་དང་། ཀུན་ཏུ་སྤྱོད་པ་ཐམས་ཅད་སྤངས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོ་དེའི་སྤྱན་སྔར་སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་དང་ཐབས་ཅིག་ཏུ་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་གྱོན་ནས།
en: Respected Blessed One, I too became a renunciant in the same way that you renounced all your royal possessions and duties after those three months had passed and shaved your head and facial hair, donned the saffron robes, and became a renunciant out of sincere faith in the presence of the thus-gone one Lord of the Brahmā Realm together with ten thousand beings.

source: ཡང་དག་པར་དད་པས་རབ་ཏུ་བྱུང་བ་དེ་བཞིན་དུ་བདག་ཀྱང་རབ་ཏུ་བྱུང་བ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡུལ་གཞན་དུ་རྒྱུ་ཞིང་གཤེགས་པའི་བར་དུ་དེ་ནས་བདག་ཀྱང་གྲོང་རྡལ་གཞན་དུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཕྱིན་ཏེ། གྲོང་རྡལ་དེར་མཆོད་སྦྱིན་ཆེན་པོ་སོ་སོར་གནས་པར་གྱུར་ཏོ། །
en: From that point until the blessed Thus-Gone One wandered and went to another land, I went begging for alms in another town where a great sacrifice was taking place.

source: དེ་ལ་ཡང་སྲོག་ཆགས་མང་པོ་གསད་པར་བྱ་བར་འདོད་པ་དེ་ལ་གལ་ཏེ་བདག་སེམས་ཅན་འདི་དག་གསོད་པ་ལས་ཡོངས་སུ་མ་ཐར་ན།
en: There, great compassion arose in me toward those who wanted to kill living beings.

source: བདག་ཉིད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་མི་བྱ་ཞིང་རྒ་ཤིའི་ཆུ་བོ་ལས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མི་ནུས་སོ་ཞེས་སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ཏེ།
en: I thought, ‘If I don’t prevent them from killing those beings, I will not awaken to unsurpassed and perfect buddhahood, and I will not traverse the rivers of old age and death, and I will not be able to ripen beings.’

source: དེར་ཉེ་བར་ཕྱིན་ནས་དྲིས་པ།
en: I approached them and said, ‘Hey!

source: ཀྱེ་གང་གི་ཕྱིར་མཆོད་སྦྱིན་འདི་བྱ། དེ་དག་གིས་སྨྲས་པ།
en: Why are you performing this sacrifice?’

source: ཡུལ་འདིར་ཆར་མི་འབབ་པར་འགྱུར་ཞིང་། མུ་གེ་ཡང་འབྱུང་བ་དང་། འདིར་སེམས་ཅན་མང་པོ་ནད་ཀྱིས་གོས་པ་དང་། ལོང་བ་དང་། ཞར་བར་འགྱུར་བ་དང་།
en: “They replied, ‘No rain is falling in this land, there is a famine, and many beings here are struck by diseases, blind, or crippled.

source: ནང་འཁྲུག་འབྱུང་བ་དང་། རྒྱལ་པོའི་ཞམ་རིང་བ་དང་། བློན་པོ་དང་། གྲོང་དང་།
en: There is internal conflict and the king’s attendants, ministers, villages, districts, and leaders are fighting with each other.

source: ལྗོངས་དང་། མིའི་མཆོག་གཅིག་ལ་གཅིག་འཁྲུག་པ་རྣམ་པ་དེ་ལྟ་བུའི་ལྟས་ངན་པ་དེ་དག་མེད་པར་བྱ་བ་དང་། ནད་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། ཀུན་འདུས་པར་བྱ་བའི་ཕྱིར་མཆོད་སྦྱིན་འདི་བྱའོ། །
en: We are going to perform this sacrifice to dispel those bad omens, to cure diseases, and to reconcile everyone.’

source: དེ་ནས་དེ་དག་ལ་བདག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཞིན་བཟངས་སེམས་ཅན་འདི་དག་གསོད་པ་ལས་ཡོངས་སུ་ཐར་བར་ནུས་ཀྱིས་མཆོད་སྦྱིན་གྱི་ར་བ་འདིར་མ་གསོད་ཅིག །
en: “I then said to them, ‘Good people, you can prevent those beings from being killed! Do not kill in this sacrificial enclosure!

source: བདག་གིས་ཁྱོད་ལ་མུ་གེ་དང་། ཆར་མི་འབབ་པ་དང་། ནད་དང་། ནང་གི་འཁྲུག་པ་ཐམས་ཅད་ཡོངས་སུ་ཞི་བར་བྱའོ། །
en: I shall completely pacify all your famines, droughts, diseases, and internal wars!’

source: དེ་དག་གིས་སྨྲས་པ། དགེ་སྦྱོང་མགོ་རེག་ནུས་སམ་ཞེས་པ་དང་།
en: “They asked, ‘Are shaven-headed monks capable of such things?’

source: བདག་གིས་སེམས་ཅན་དེ་དག་ལ་མཆོད་སྦྱིན་གྱི་ར་བ་མི་སྣང་བར་བྱས་སོ། །དེ་ལ་ཡང་བདག་གིས་སྨོན་ལམ་འདི་ལྟ་བུ་བཏབ་སྟེ། བཅོམ་ལྡན་འདས་མད་པར་གསུངས་པས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ལུང་བསྟན་པ་དེ་ལྟ་བུའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: “I then made the sacrificial enclosure disappear before those beings and made the following aspiration: ‘Since the Blessed One speaks the truth, may the prophecy he made about my awakening to unsurpassed and perfect buddhahood be fulfilled!

source: གལ་ཏེ་མཆོད་སྦྱིན་འདིའི་ཕྱིར་སྨོན་ལམ་ཡོངས་སུ་དག་པས་བདག་བསད་དེ། བདག་གིས་ལུས་ཐམས་ཅད་ཀྱི་བ་སྤུའི་ཁུང་བུ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་ལྷ་དང་།
en: If I am killed for this sacrifice with a completely pure aspiration, I will offer this body to as many local protector gods, nāgas, and yakṣas as there are pores on my entire body.

source: ཀླུ་དང་། གནོད་སྦྱིན་ཡུལ་ཡོངས་སུ་སྐྱོང་བ་ལ་ལུས་འདི་དབུལ་བར་བྱ་ཞིང་བདག་གི་ཁྲག་ཤིན་ཏུ་རྒྱ་ཆེ་བ་མདངས་ཅན་བྱུང་བར་གྱུར་ནས་ཡུལ་ཡོངས་སུ་སྐྱོང་བ་དེ་དག་ཀྱང་ཁྲག་འདི་ལ་ཡོངས་སུ་འཐུང་བར་གྱུར་ཅིག །
en: As my abundant, fresh blood spills, may those local protectors drink the blood!

source: ཡོངས་སུ་འཐུངས་པས་ཡུལ་སྐྱོང་བ་རེ་རེ་ལ་ཡང་ཡུལ་འདིར་དེ་ཙམ་གྱི་ལྟས་ངན་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །
en: By drinking it, may each of those local protectors pacify the bad omens of this land!

source: དེ་ཙམ་གྱིས་བདེ་བ་དང་། ལོ་ལེགས་པ་དང་།
en: May they provide happiness, good harvests, and good health to this land!

source: ནད་མེད་པས་ཐབ་མོ་དང་། བཅིང་བ་དང་། གནོད་པ་དང་། རྩོད་པ་ལ་འཇུག་པའི་གཉེན་པོར་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཅིག །
en: May that bring about prosperity as an antidote to fighting, bondage, harm, and disputes!

source: སེམས་ཅན་རེ་རེ་ཞིང་ཡང་འདིར་དེ་ཙམ་གྱི་བདེ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ཅིག །སེམས་ཅན་རྣམས་ཀྱི་ཡུལ་འདིར་དེ་ཙམ་གྱི་ལུས་ཀྱི་གནས་ངན་ལེན་དང་།
en: May all the beings living in this place be happy and satisfied!

source: ངག་གི་གནས་ངན་ལེན་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་མེད་པར་གྱུར་ཅིག །
en: May they have no physical, verbal, or mental negative tendencies!

source: ཡུལ་ཇི་ཙམ་པ་འདིར་སེམས་ཅན་ཐམས་ཅད་དེ་ཙམ་གྱི་མཆོག་ཏུ་བདེ་བས་ཚིམ་པར་གྱུར་ཅིག །
en: May all beings in this entire land be fulfilled with the most supreme forms of happiness!

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེའི་ཚེ་སེམས་ཅན་འདི་ཐམས་ཅད་རྒ་ཤི་ལས་ཡོངས་སུ་ཐར་པར་བྱའོ། །
en: When I awaken to unsurpassed and perfect buddhahood, I will liberate all these beings from old age and death!

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤུའི་ཁུང་བུ་ཇི་ཙམ་པར་གྱུར་པ་དེ་ཙམ་གྱི་བསྐལ་པ་ཆེན་པོའི་གླིང་བཞི་པ་རེ་རེ་ལ་མཆོད་སྦྱིན་གྱི་ར་བར་མཆོད་སྦྱིན་གྱི་ཕྱིར་བདག་བསད་ལ། གང་མི་དག་མཆོད་སྦྱིན་གྱི་ར་བའི་ཕྱིར་གསད་པར་འགྱུར་བ་དང་།
en: May I be sacrificed in the sacrificial enclosures in each of the four-continent worlds of this great eon, as numerous as all the pores of all beings.

source: གང་བྱོལ་སོང་གི་སྐྱེ་གནས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་བདག་མཆོད་སྦྱིན་གྱི་ར་བ་དེ་དག་ཏུ་གསད་པར་བྱོས་ཤིག །དེ་ནས་ཡུལ་འདིར་བདག་གི་ལུས་མི་སྣང་བར་གྱུར་ཅིག །ཡུལ་དེ་ན་གསོད་པ་དང་། ནད་དང་། མུ་གེ་དང་། ཆར་མི་འབབ་པ་དང་། འཁྲུག་པ་གཉིས་དང་། ཤིན་ཏུ་གྲང་བ་དང་། ཤིན་ཏུ་དྲོ་བ་དང་།
en: May I be killed for the sake of the people in those sacrificial enclosures and may I be killed for the sake of the animals in those sacrificial enclosures!

source: དུག་དང་། བྱད་སྟེམས་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་། དུས་མ་ཡིན་པའི་ཆར་དང་། དུས་མ་ཡིན་པའི་སྦྲང་མ་དང་། ཤ་སྦྲང་དང་། སྦྲུལ་གདུག་པ་དང་། ཕྱེ་མ་ལེབ་གསོད་པ་དང་། སྡོམ་པ་མེད་པའི་ལོངས་སྤྱོད་ཡོངས་སུ་ཚོལ་བ་དང་། ཆོས་མ་ཡིན་པ་ལ་ཆགས་པ་དང་། སླུ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་། ཆགས་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་ཞེས་བྱ་བ་འདི་དག་གི་དངོས་པོ་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །དེ་ན་སེམས་ཅན་རྣམས་གཅིག་ལ་གཅིག་དགའ་བའི་སེམས་དང་།
en: May my body then disappear from this land, and may things in this land such as killings, diseases, famines, droughts, conflicts, extreme cold, extreme heat, poisons, curses, untimely winds, untimely rain showers, untimely swarms of flies, biting flies, mosquitoes, killer locusts, unrestrained pursuits of material possessions, attachment to unlawfulness, deceit, slander, harsh speech, idle gossip, covetousness, ill will, and wrong views be completely pacified!

source: འཇམ་པའི་སེམས་དང་། ལས་སུ་རུང་བའི་སེམས་དང་། གཟུང་དུ་མེད་པའི་སེམས་དང་། ས་དང་མཚུངས་པ་བྲལ་བ་མེད་པའི་སེམས་དང་། སྦྱིན་པའི་སེམས་སུ་གྱུར་ཅིག །དེ་ན་སེམས་ཅན་རྣམས་འབྱུང་བའི་སེམས་དང་། ཚུལ་ཁྲིམས་ཀྱི་སེམས་དང་།
en: May all the beings there be pleasant, gentle, accommodating, detached, and generous toward each other, and may they never wish to be separated from each other, like the ground!

source: ཞི་གནས་ཀྱི་སེམས་དང་། བརྩོན་འགྲུས་ཀྱི་སེམས་དང་། བཟོད་པའི་སེམས་དང་། བསམ་གཏན་གྱི་སེམས་དང་། ཤེས་རབ་ཀྱི་བསྒོམ་པ་ཡོངས་སུ་ཚོལ་བའི་སེམས་སུ་གྱུར་ཅིག །
en: May they have an attitude of renunciation, discipline, tranquility, diligence, patience, concentration, and one that is devoted to the cultivation of insight!

source: གང་ལ་བདག་མཆོད་སྦྱིན་གྱི་ཕྱིར་གསད་པར་བྱ་བ་ནས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དང་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་དུ་རྩལ་ཆེན་པོ་བྱ་བའི་བར་དུ་བདག་གི་སྔོན་གྱི་ལྟས་དེ་དག་བྱུང་བར་གྱུར་ཅིག །
en: May the preceding good omens arise from the moment that I am killed for the sacrifice and for as long as it takes for me to act with great skill in all the empty buddha realms and buddha realms that are inundated with the five impurities of the ten directions as numerous as all the grains of sand in the Ganges!

source: ནམ་མཁའ་ལས་ཆར་འབབ་པར་གྱུར་ཅིག་ཅེས་བདག་གིས་ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་བདག་གི་ལུས་ཐམས་ཅད་ཀྱི་བ་སྤུའི་ཁུང་བུ་ལས་འོ་མ་ཟག་ཅིང་ནམ་མཁའ་ལས་ཆར་ཀྱང་རབ་ཏུ་འབབ་བོ། །
en: May rain fall from the sky!’ “As soon as I had said those words, milk flowed from all the pores of my body and rain started to fall from the sky.

source: དེ་ན་ཡང་མཆོད་སྦྱིན་ཅན་དེས་མི་གསད་པར་བཅོམ་ལྡན་འདས་ལ་འདིར་དཔང་དུ་གསོལ་ཏེ།
en: The beings holding the sacrifice did not kill me and then asked to be under the Blessed One’s power.

source: ཡུལ་དེ་ན་ཐམས་ཅད་ཀྱང་དཔལ་ཕུན་སུམ་ཚོགས་པ་བདེ་བའི་ཡོ་བྱད་དང་འཐུན་པར་གྱུར་ཏོ། །
en: Everyone in that land prospered, flourished, and was well provisioned and harmonious.

source: ནད་དང་། ཐབ་མོ་དང་། མུ་གེ་དང་། ཆར་མི་འབབ་པ་མི་སྣང་བར་བྱས་ཏེ།
en: Diseases, fights, famines, and droughts disappeared.

source: གང་བདག་མིར་གྱུར་པས་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་མཆོད་སྦྱིན་གྱི་ར་བ་ལ་མཆོད་སྦྱིན་བྱས་པ་བཅོམ་ལྡན་འདས་དཔང་དུ་གསོལ་ལོ། །བལ་གླང་གི་གཟུགས་ཀྱིས་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་མཆོད་སྦྱིན་བྱས་པ་ནས་རྟའི་གཟུགས་དང་། གཡག་གི་གཟུགས་དང་། གླང་གི་གཟུགས་དང་། ཕག་གི་གཟུགས་དང་།
en: I also asked the Blessed One to witness my confession of all the sacrifices I had performed as a human in sacrificial enclosures as numerous as all the grains of sand in the Ganges.

source: སྤྱང་ཀིའི་གཟུགས་དང་། ཕྱུགས་ཀྱི་གཟུགས་དང་། བསེའི་གཟུགས་དང་། མ་ཧེའི་གཟུགས་དང་། ཝའི་གཟུགས་བསྡུས་པས་བདག་བྱོལ་སོང་གི་སྐྱེ་གནས་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ལ་སྐྱེ་གནས་རེ་རེ་ཐོབ་པས་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་ཀྱི་འཁོར་ལ་མཆོད་སྦྱིན་བྱས་སོ། །
en: I took rebirth as each of the 84,000 different animal births where I offered myself in sacrifices as numerous as all the grains of sand in the Ganges while assuming the physical appearances of animals such as horses, yaks, bulls, pigs, wolves, cows, rhinoceroses, buffaloes, and foxes.

source: ཕྱོགས་བཅུ་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་ཆུ་བོ་གང་གཱའི་བྱེ་མ་སྙེད་དུ་རྣམ་པ་དེ་ལྟ་བུའི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་རྣམས་བདེ་བས་ཚིམ་པར་བྱས་པ་རྣམ་པ་དེ་ལྟ་བུའི་རྩལ་ཆེན་པོ་བྱས་སོ།། །།བམ་པོ་བཅུ་གཅིག་པ་སྟེ་ཐ་མ།
en: I demonstrated my great skill and satisfied beings in afflicted buddha realms of the ten directions that are inundated with the five impurities by providing them with all manner of necessities.

source: ཡང་བཙུན་པ་བཅོམ་ལྡན་འདས་ངན་པའི་དུས་ཀྱི་ཚེ་ནད་པ་ལ་ལ་ཞིག་གི་དོན་དུ་རའི་གཙང་ཤ་འཚལ་བར་གྱུར་ལ། ཡུལ་དེ་ན་ར་མ་མཆིས་ན་དེ་ལ་བདག་གིས་སྨོན་ལམ་འདི་ལྟ་བུ་བཏབ་སྟེ། གལ་ཏེ་བདག་བླ་ན་མེད་པའི་ཤེས་རབ་ཆེན་པོ་མ་ཐོབ་ཀྱི་བར་དུ་བདག་གི་སྨོན་ལམ་འདི་གྲུབ་པར་གྱུར་ཅིག །བདག་ཤིང་ཆེན་པོ་འདི་ལ་འཛེགས་ཏེ། བདག་མཆོངས་ནས་རྫུས་ཏེ་རར་སྐྱེས་ལ།
en: “Furthermore, respected Blessed One, during that difficult time when the pure meat of a goat was requested for some sick people but that country had no goats, I made the following aspiration: ‘So long as I have not attained unsurpassed great insight, may this aspiration be fulfilled: I will climb this big tree, jump from it, and be miraculously reborn as a goat.

source: ལྷས་མི་རྣམས་ལ་བསྒོ་བ་འདི་ནི་ནད་པ་རྣམས་ཀྱི་སྨན་དུ་གྱུར་པ་ཡིན་གྱིས་སེམས་ཅན་དེ་དག་གིས་ཤ་ཟོ་ཤིག་དང་།
en: The gods will then tell those humans that the goat’s meat is the medicine that will cure their diseases, and that they should therefore eat that meat.

source: དེ་དག་གི་ནད་དེ་ཞི་བར་འགྱུར་རོ། །
en: It will cure their diseases.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་དུ་བདག་འཇིག་རྟེན་དུ་སངས་རྒྱས་སུ་གྱུར་པ་དེར་སེམས་ཅན་རྣམས་ཤ་ཟ་བར་མ་གྱུར་ཅིག །
en: When I appear in the world as a buddha, may the beings in my buddha realm not eat meat!

source: དེ་ན་ནད་ཀྱིས་རེག་པ་རྣམས་ལ་སྨན་དུ་མ་གྱུར་པའི་དངོས་པོ་མེད་པར་གྱུར་ཅིག །
en: May there be nothing that is not medicine for those who contract diseases!

source: ཡིད་དུ་མི་འོང་བའི་སྒྲ་མི་གྲག་པར་གྱུར་ཅིག །
en: May no cries of distress be heard!

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་རྣམས་ལོངས་སྤྱོད་དང་ཀུན་ཏུ་སྤྱོད་པས་ཕོངས་པར་འགྱུར་བའི་སྒྲ་མི་གྲག་པར་གྱུར་ཅིག །
en: May beings in that buddha realm never hear cries of being destitute of resources and possessions!

source: བདག་ད་ལྟར་རའི་གཟུགས་ཀྱིས་ནད་པ་རྣམས་བསྙེན་བཀུར་བྱེད་པ་དེ་བཞིན་དུ་ཇི་སྲིད་དུ་ཡུན་རིང་པོར་འཁོར་བ་ན་སེམས་ཅན་རྣམས་ནད་ཀྱིས་རེག་པར་གྱུར་པ་ལ་ཤ་དང་། ཁྲག་དང་། འོ་མ་དང་། མར་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་ནད་ཞི་བར་འགྱུར་བ་དེ་སྲིད་ཀྱི་ཡུན་རིང་པོར་སེམས་ཅན་རྣམས་ཀྱི་ནད་ཞི་བར་བགྱི་བའི་སླད་དུ་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གྱུར་ཅིག །
en: Just as I serve those sick beings today by assuming the form of a goat, for as long as beings in saṃsāra who have contracted diseases can be cured by meat, blood, milk, or butter, may I be reborn as an animal to cure their diseases!’

source: བདག་ཤིང་དེ་ལས་འཛེགས་ནས་བདག་མཆོངས་ཏེ། དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པ་དྲུག་ཏུ་གཡོས་ལ། བརྒྱ་བྱིན་དང་།
en: “I climbed the tree and jumped from it, and this entire great trichiliocosm shook in six ways.

source: ཚངས་པ་དང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། ཨ་ག་རུ་དང་།
en: Śakra, Brahmā, and myriads of gods rained showers of divine flowers, incense, garlands, and powders of aloeswood, takara, and yellow sandalwood.

source: ཏ་ཀ་ར་དང་། དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་རབ་ཏུ་ཕབ་ནས་བདག་གི་མདུན་དུ་ཐལ་མོ་སྦྱར་ཏེ་འདུག་ལ་འདི་སྐད་ཅེས་སྨྲས་ཏེ། སྐྱེས་བུ་དམ་པ་སེམས་ཅན་ནོ་ཅོག་གིས་བདག་མ་གསད་ཅིག་དང་། བདག་ཅག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་སེམས་ཅན་ནད་པ་རྣམས་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་བྱའོ། །
en: They sat before me with their palms joined and said, ‘Holy being, may no beings be slaughtered!

source: ཆར་མི་འབབ་ཅིང་མུ་གེ་འབྱུང་བ་ཐམས་ཅད་དང་། ན་བ་དང་། འཆི་བ་དང་། ཐབ་མོ་དང་། རྩོད་པ་ནས་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་བར་ལས་ཀྱང་ཐར་བར་བྱ་སྟེ།
en: We will liberate sick beings in every buddha realm from all their diseases, and we will liberate them from everything from droughts, famines, sicknesses, deaths, fights, and disputes to the path of the ten nonvirtuous actions!

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་སེམས་ཅན་རྣམས་སྦྱར་བར་བྱའོ། །
en: We will cause beings to practice the path of the ten virtuous actions!’

source: བདག་ཤིང་དེ་ལས་མཆོངས་པ་ལྷ་རྣམས་ཀྱིས་བདག་ནམ་མཁའ་བར་སྣང་ལས་བཟུང་སྟེ།
en: When I jumped from that tree, the gods caught me in the air.

source: དེ་ན་བདག་གིས་སེམས་ཅན་རྣམས་ལ་བསླབས་ནས་སེམས་ཅན་རྣམས་ཆོས་ལ་སྦྱོར་བར་བྱས་སོ། །དེ་ན་བདག་གིས་སེམས་ཅན་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ལྔ་མངོན་པར་ཤེས་པ་དང་ལྡན་པར་བྱས་སོ། །
en: Then I instructed those beings in a way that caused them to practice the Dharma and caused fifty trillion of them to develop the supernormal faculties.

source: བདག་གི་ཚིག་གིས་ལྷ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་དུ་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་བར་ལ་བཙུད་ཅིང་སོ་སོར་བཀོད་དོ། །
en: Because of what I had said, the gods led and placed the beings in all those buddha realms on the path of the ten virtuous actions.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་ནི་དེ་ལྟ་བུ་ལགས་སོ། །
en: Respected Blessed One, those were my aspirations.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་དབྱངས་ལ་ལེགས་ས་ཞེས་བྱ་བ་བྱིན་ནས་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་སྨོན་ལམ་དེ་ལྟ་བུར་གྱུར་ཏེ། སྤྱད་པར་དཀའ་བ་སྤྱོད་པའི་སེང་གེའི་སྒྲ་དེ་ལྟ་བུ་བསྒྲགས་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One gave his approval to the bodhisattva Melody of Space, saying, “Noble son, it is as though your aspirations about conduct that is difficult to perform are resounding like a lion’s roar. This is excellent, excellent!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཇི་ལྟར་སྡོན་གང་ག་ཞེས་བྱ་བ་ཉི་མ་ལ་དགའ་བར་གྱུར་པ་དེ་ངས་བསྐུལ་ནས་ཐོག་མར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མ་གྱུར་ཏམ།
en: Noble son, in the past when you were called Gaṅga and were devoted to the sun, did I not exhort you to give rise to the mind set on awakening for the first time?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་སྔོན་ལན་འགའ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་པ་མ་མཆིས་སོ། །
en: “Respected Blessed One, I never gave rise to the mind set on unsurpassed and perfect awakening in the past.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཐོག་མ་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ནི་འདི་ལགས་ཏེ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོའི་ཐད་དུ་མཆིས་ཏེ། དེའི་ཚེ་ད་ལྟར་ཇི་སྐད་དུ་བརྗོད་པའི་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་བོ། །
en: Respected Blessed One, the first time I became a bodhisattva was when I was before the Thus-Gone One Lord of the Brahmā Realm and made the aspirations I have just mentioned.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་གལ་ཏེ་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མ་གྱུར་ན་སྨོན་ལམ་དེ་ལྟ་བུ་སུས་བསླབས། གསོལ་པ།
en: “Noble son,” asked the Blessed One, “if you had not previously given rise to the mind set on awakening, then who taught you those aspirations?”

source: དེ་ན་བདག་དབེན་པ་ཞིག་ཏུ་མཆིས་ཏེ།
en: “At that time, I went to the wilderness.

source: དོག་ས་ལ་མཆིས་ནས་སྨོན་ལམ་ཞིག་གདབ་པར་སེམས་པ་དེ་ན་བདག་གི་རྨི་ལམ་དུ་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་པོས་སྨོན་ལམ་དེ་དག་བསྒོ་བ་དང་།
en: I sat on the ground and reflected about the aspirations I might make.

source: དེས་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔར་སྨོན་ལམ་བཏབ་བོ། །
en: Then the Thus-Gone One Lord of the Brahmā Realm instructed me to make those aspirations in a dream, so I made them before that thus-gone one.

source: དེ་ན་བདག་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་སྐྱེས་ཏེ་འཁོར་བའི་སྐྱོན་རྟོགས་སོ། །
en: I developed compassion for beings and I realized the defects of saṃsāra.

source: དེ་ཕྱིས་རྗེས་སུ་དཔག་པ་དེས་མཆོད་སྦྱིན་སྨྲ་བ་བདག་ཡོངས་སུ་བཏང་བ་བགྱིས་ཏེ། སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་བོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: After that, because of that consideration, I performed these acts of generosity for the proponents of sacrificial rituals, and I made those aspirations.”

source: ཅི་ཁྱོད་ལྟ་བར་སོང་བ་དེ་དག་ཏུ་ཞུགས་སམ།
en: “Did you adhere to mistaken views?”

source: གསོལ་པ།
en: asked the Blessed One.

source: མ་ལགས་སོ།
en: “No, I did not.”

source: སུ་ཞིག་གི་མཐུས། གསོལ་པ།
en: “Whose power prevented this?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་སོ། །
en: “Respected Blessed One, it was the power of those extraordinary aspirations.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One then said, “Thus it is, noble son!
